/* String format for displaying account number in account detail header. */
"AccountDetail.Header.AccountNumberFormat" = "Account number: %@";

/* Text for message to display if there are no archived actionable insights. */
"ActionableInsights.Archive.EmptyState" = "ActionableInsights.Archive.EmptyState";

/* Title for list of archived insights. */
"ActionableInsights.Archive.Title" = "Archive";

/* Text shown to describe when an insight was archived. */
"ActionableInsights.ArchivedInsight.ActionDescription" = "ActionableInsights.ArchivedInsight.ActionDescription";

/* Description of saved amount per year for insight suggesting creating a budget based on spending in a category. */
"ActionableInsights.BudgetSuggestCreateTopCategory.SuggestedAmountDetail" = "Save up to %@ per year";

/* Button title for button to present archived insights list. */
"ActionableInsights.List.ArchiveButton" = "Archive";

/* Text for message to display if there are no actionable insights. */
"ActionableInsights.List.EmptyState" = "ActionableInsights.List.EmptyState";

/* Title for actionable insights list. */
"ActionableInsights.List.Title" = "Events";

/* Formatting of transaction count in actionable insight. */
"ActionableInsights.SuggestCategories.TransactionCount" = "%d expenses";

/* Description for where and when the largest transaction that happened during last month or week. */
"ActionableInsights.TransactionSummary.LargestExpense.Detail" = "To %1$@ (%2$@)";

/* Description for the largest transaction that happened during last month or week. */
"ActionableInsights.TransactionSummary.LargestExpense.Title" = "%@ was your largest expense";

/* Description for the number of transactions that happened last month. */
"ActionableInsights.TransactionSummary.LastMonthTotalCount" = "%d transactions last month";

/* Description for the number of transactions that happened last week. */
"ActionableInsights.TransactionSummary.LastWeekTotalCount" = "%d transactions last week";

/* Description for most common transaction and how many times it happened during last month or week. */
"ActionableInsights.TransactionSummary.MostCommonTransaction" = "Most common was %1$@ (%2$d)";

/* Description for sum of transactions that happened during the last month or week. */
"ActionableInsights.TransactionSummary.TotalExpenses" = "%@ in total expenses";

/* Legend for weekly expenses by day insight. */
"ActionableInsights.WeeklyExpensesByDay.Legend" = "Average";

/* Message to ask if budget should be deleted. */
"Budget.Alert.Delete.Message" = "Are you sure you want to delete the budget “%@”?";

/* Title for message to ask if budget should be deleted. */
"Budget.Alert.Delete.Title" = "Delete budget?";

/* Formatter name for all expenses category. */
"Budget.Category.AllExpenses" = "All expenses";

/* Title for create a budget with keyword. */
"Budget.CreateBudget.CreateWithKeyword" = "Create with keyword";

/* Title of the select category modal shown when creating a budget. */
"Budget.CreateBudget.Title" = "Create budget";

/* Title for budgets. */
"Budget.Detail.Monthly.Title" = "Monthly";

/* Text for the empty budgets overview. */
"Budget.Detail.Overview.Empty" = "Budget.Detail.Overview.Empty";

/* Budget overview last year description text. */
"Budget.Detail.Overview.PreviousYearDescription" = "You made your budget %@ of the time";

/* Budget overview 3 months description text. */
"Budget.Detail.Overview.ThreeMonthDescription" = "You made your budget %@ of the time over the last year";

/* Title for budgets overview. */
"Budget.Detail.Overview.Title" = "Over time";

/* Budget overview week description text. */
"Budget.Detail.Overview.WeekDescription" = "You made your budget %1$@ of the time since week %2$@";

/* Budget overview year description text. */
"Budget.Detail.Overview.YearDescription" = "You made your budget %1$@ of the time since %2$@";

/* Budget detail view completed in days text. */
"Budget.Detail.Progress.Completed.Days" = "Completed %d days ago";

/* Budget detail view completed in days text. */
"Budget.Detail.Progress.Completed.Months" = "Completed %d months ago";

/* Budget detail remaining budget within period. */
"Budget.Detail.Progress.Left" = "You can spend %@ and still remain within your budget";

/* Budget detail remaining budget daily. */
"Budget.Detail.Progress.Left.Daily" = "You can spend %@ per day and still remain within your budget";

/* Budget detail view progress left from text. */
"Budget.Detail.Progress.Left.From" = "left of %@";

/* Budget detail remaining budget monthly. */
"Budget.Detail.Progress.Left.Monthly" = "You can spend %@ per month and still remain within your budget";

/* Budget detail remaining budget weekly. */
"Budget.Detail.Progress.Left.Weekly" = "You can spend %@ per week and still remain within your budget";

/* Budget detail remaining budget yearly. */
"Budget.Detail.Progress.Left.Yearly" = "You can spend %@ per year and still remain within your budget";

/* Budget detail managed budget text. */
"Budget.Detail.Progress.Managed" = "You managed your budget for this period";

/* Budget detail budget has not started. */
"Budget.Detail.Progress.NotStarted" = "Budget hasn't started yet";

/* Description text shown on budget detail view when user spent more than their budget target for the current period. */
"Budget.Detail.Progress.Over" = "You spent over your budget for this period";

/* Budget detail view remaining days. */
"Budget.Detail.Progress.RemaingTime.MultipleDays" = "%d days remaining";

/* Budget detail view for one remaining day. */
"Budget.Detail.Progress.RemaingTime.OneDay" = "One day remaining";

/* Description text shown on budget detail view when user spent as much as the budget target for the current period. */
"Budget.Detail.Progress.Spent" = "You have no remaining budget for this period";

/* Budget detail view starts in days text. */
"Budget.Detail.Progress.StartIn" = "Starts in %d days";

/* See budget detail transactions text. */
"Budget.Detail.SeeTransactions" = "See transactions";

/* Title for budgets. */
"Budget.Detail.Weekly.Title" = "Weekly";

/* Title for budgets. */
"Budget.Detail.Yearly.Title" = "Yearly";

/* Title of the select category picker shown when editing a budget. */
"Budget.Edit.Filter.Title" = "Filter";

/* Edit budget title. */
"Budget.Edit.Title" = "Edit budget";

/* Title for the cancel button that will dismiss the select category modal shown when creating a budget. */
"Budget.Generic.CancelButton" = "Cancel";

/* Title for the button to delete a budget. */
"Budget.Generic.DeleteButton" = "Delete";

/* Title for budget edit button. */
"Budget.Generic.EditButton" = "Edit";

/* Title of button to next step when creating a budget */
"Budget.Generic.NextButton" = "Next";

/* Select button text for editing budget flow */
"Budget.Generic.SelectButton" = "Select";

/* Custom budget period type. */
"Budget.Period.Type.Custom" = "Custom";

/* Monthly budget period type. */
"Budget.Period.Type.Month" = "Monthly";

/* Weekly budget period type. */
"Budget.Period.Type.Week" = "Weekly";

/* Yearly budget period type. */
"Budget.Period.Type.Year" = "Yearly";

/* Title for budget progress left from budget. */
"Budget.Progress.LeftFrom" = "%1$@ left of %2$@";

/* Title for budget progress over budget. */
"Budget.Progress.Over" = "%@ over budget";

/* Title for budget spent. */
"Budget.Progress.Spent" = "%@ spent";

/* Amount text field placeholder text shown when creating or editing budget. */
"Budget.Target.Amount.Placeholder" = "Amount";

/* Formatter for average spending per time period. */
"Budget.Target.Average" = "Average %1$@ / %2$@";

/* Month formatter long text. */
"Budget.Target.Average.PeriodMonth" = "month";

/* Week formatter long text. */
"Budget.Target.Average.PeriodWeek" = "week";

/* Year formatter long text. */
"Budget.Target.Average.PeriodYear" = "year";

/* Period filter field placeholder text when editing budget. */
"Budget.Target.CategoryFilter.Placeholder" = "Category";

/* Create button text for editing budget flow. */
"Budget.Target.CreateButton" = "Create budget";

/* Period end date field placeholder text shown when creating or editing budget. */
"Budget.Target.EndPeriod.Placeholder" = "End date";

/* Period filter field placeholder text when editing budget. */
"Budget.Target.KeywordFilter.Placeholder" = "Keyword";

/* Name text field placeholder text shown when creating or editing budget. */
"Budget.Target.Name.Placeholder" = "Name";

/* Period type selection field placeholder text shown when creating or editing budget. */
"Budget.Target.Period.Placeholder" = "Budget period";

/* Edit button text for editing budget flow. */
"Budget.Target.SaveButton" = "Save changes";

/* Period start date field placeholder text shown when creating or editing budget. */
"Budget.Target.StartPeriod.Placeholder" = "Start date";

/* Title for budgets overview. */
"Budget.Transactions.EmptyState" = "No transactions";

/* Title for the cancel button that will dismiss the select category modal shown when categorizing a transaction. */
"Categorization.CategoryPicker.CancelButton" = "Cancel";

/* Message to show when no categories are found. */
"Categorization.CategoryPicker.NoCategoriesError.Message" = "Could not load any categories.";

/* Title to show in when no categories are found. */
"Categorization.CategoryPicker.NoCategoriesError.Title" = "Error";

/* Title of the select category modal shown when categorizing a transaction. */
"Categorization.CategoryPicker.Title" = "Select a category";

/* Default button title for select button if the user has one or more similar transactions. */
"Categorization.SimilarTransactions.ChangeSelectedButton.HasSelectedTransactions" = "Change %d Selected";

/* Default button title for select button if the user has deselected all similar transactions. */
"Categorization.SimilarTransactions.ChangeSelectedButton.NoSelectedTransactions" = "Change Selected";

/* Description text shown above list of similar transactions shown after selecting a category when categorizing a transaction. */
"Categorization.SimilarTransactions.Description" = "Do you want to categorize these transactions as %@ also";

/* Right bar button title for selecting all similar transactions. */
"Categorization.SimilarTransactions.SelectAll" = "Select all";

/* Button title for for button to skip selecting any similar transactions. */
"Categorization.SimilarTransactions.SkipButton" = "Skip";

/* Title for similar transactions screen. */
"Categorization.SimilarTransactions.Title" = "Similar Transactions";

/* Right bar button title for unselecting all similar transactions. */
"Categorization.SimilarTransactions.UnselectAll" = "Unselect all";

/* Title for select button in category picker modal to filter statistics on the over time screen. */
"CategoryStatistics.CategoryPicker.SelectButton" = "Select";

/* Title for category picker modal to filter statistics on over time screen. */
"CategoryStatistics.CategoryPicker.Title" = "Categories";

/* Description of option to not filter statistics by a category but instead show statistics for all categories. */
"CategoryStatistics.CategoryPicker.Title.ShowAll" = "All categories";

/* Description for option to not filter category statistics within a specific time range. */
"CategoryStatistics.FilterPeriod.AllTime" = "All time";

/* Cancel button for sheet with options to filter category statistics over time by different time periods. */
"CategoryStatistics.FilterPeriod.CancelButton" = "Cancel";

/* Description for option to filter category statistics within the last 12 months. */
"CategoryStatistics.FilterPeriod.Last12Months" = "Last 12 months";

/* Description for option to filter category statistics within the last 6 months. */
"CategoryStatistics.FilterPeriod.Last6Months" = "Last 6 months";

/* Title for sheet with options to filter category statistics overtime by different time periods. */
"CategoryStatistics.FilterPeriod.Title" = "Time period";

/* Title of button to list transactions for the currently shown statistics. */
"CategoryStatistics.Generic.TransactionsButton" = "Transactions";

/* Title for list of transactions that are not one with the largest amounts of the category. */
"CategoryStatistics.GroupedTransactions.Title.Other" = "Transactions";

/* Title for list of transactions that are similar in the same category. */
"CategoryStatistics.GroupedTransactions.Title.Top" = "Transactions";

/* Title for button to show list of categories to filter statistics by. */
"CategoryStatistics.OverTime.FilterCategoryButton.AllCategories" = "All categories";

/* Subtitle shown when user long press bar in chart for expenses category statistics. */
"CategoryStatistics.OverTime.LongPressSubtitle.Expenses" = "Spent in %@";

/* Subtitle shown when user long press bar in chart for category statistics with a category filter set. */
"CategoryStatistics.OverTime.LongPressSubtitle.FilterCategory" = "%1$@ in %2$@";

/* Subtitle shown when user long press bar in chart for income category statistics. */
"CategoryStatistics.OverTime.LongPressSubtitle.Income" = "Income in %@";

/* Subtitle shown when user long press bar in chart for transfer category statistics. */
"CategoryStatistics.OverTime.LongPressSubtitle.Transfer" = "Transferred in %@";

/* Title of list item representing a group of transactions that are not one with the largest amounts of the category. */
"CategoryStatistics.TopTransactions.Other" = "Other";

/* Title for list of transactions representing the currently shown statistics. */
"CategoryStatistics.Transactions.Title" = "Transactions";

/* Short suffix to use when formatting amounts larger than a million. */
"Generic.AmountFormatter.Abbreviation.Millions" = " m";

/* Short suffix to use when formatting amounts larger than a 10 000. */
"Generic.AmountFormatter.Abbreviation.Thousands" = " k";

/* Cancel button for canceling. */
"Generic.Cancel" = "Cancel";

/* How two dates in different years should be formatted, e.g. 25 Dec - 24 Jan. */
"Generic.DateRangeFormatter.YearSpan" = "%1$@ – %2$@";

/* Title of button to dismiss a generic error alert. */
"Generic.ErrorAlert.DismissButton" = "OK";

/* Message to show in a generic error alert. */
"Generic.ErrorAlert.Message" = "Something went wrong.";

/* Title to show in a generic error alert. */
"Generic.ErrorAlert.Title" = "Error";

/* Title for category statistics representing only expenses. */
"Generic.Expenses.Title" = "Expenses";

/* Title for category statistics representing only incomes. */
"Generic.Income.Title" = "Income";

/* Title for left to spend statistics. */
"Generic.LeftToSpend.Title" = "Left to spend";

/* Title for tab showing chart of data for one month. */
"Generic.Monthly.TabTitle" = "Monthly";

/* Subtitle with average per month shown on over time views. */
"Generic.OverTime.AverageSubtitle" = "%@ in average per month";

/* Title for tab showing bar chart of data over time. */
"Generic.OverTime.TabTitle" = "Over time";

/* Title for category statistics representing only transfers. */
"Generic.Transfers.Title" = "Transfers";

/* Human enumerated formatter text for and. */
"Human.Enumerated.formatter.And" = "and";

/* Subtitle shown when user long press bar in chart for left to spend statistics. */
"LeftToSpend.OverTime.LongPressSubtitle" = "Left to spend in %@";

/* Left to spend per day until next salary in a number of days. */
"LeftToSpend.Progress.Current.DaysLeft" = "You can spend %1$@ per day until next salary in %2$d days.";

/* Left to spend today. */
"LeftToSpend.Progress.Current.LastDay" = "You have %@ left to spend today.";

/* Left to spend per is less than usual. */
"LeftToSpend.Progress.Current.Less" = "You have %@ less than you usually have this time of the month";

/* Left to spend is more than usual. */
"LeftToSpend.Progress.Current.More" = "You have %@ more than you usually have this time of the month";

/* Left to spend per day until next salary tomorrow. */
"LeftToSpend.Progress.Current.OneDayLeft" = "You can spend %@ until tomorrow.";

/* Left to spend less than average for previous month. */
"LeftToSpend.Progress.Past.BelowAverage" = "You spent %@ below your average.";

/* Left to spend less default. */
"LeftToSpend.Progress.Past.Default" = "You have an average of %1$@ Left to Spend in %2$@";

/* Left to spend more than average for previous month. */
"LeftToSpend.Progress.Past.OverAverage" = "You spent %@ over your average.";

/* Text to display in overview when there are no accounts. */
"Overview.Accounts.EmptyState" = "Overview.Accounts.EmptyState";

/* Recent insights suffix. */
"Overview.ActionableInsights.RecentInsights" = "recent events";

/* Recent insight suffix. */
"Overview.ActionableInsights.RecentInsights.Singular" = "recent event";

/* Title for button to view actionable insights. */
"Overview.ActionableInsights.ViewButton" = "View";

/* Title for card to show archived actionable insights. */
"Overview.ActionableInsightsArchive.Title" = "View archived events";

/* Title for list of all transactions. */
"Overview.AllTransactions.Title" = "All transactions";

/* Title for button to add new budget. */
"Overview.Budgets.EmptyNewBudgetButton" = "Create new budget";

/* Title for button to add new budget. */
"Overview.Budgets.NewBudgetButton" = "New budget";

/* Title for budgets. */
"Overview.Budgets.Title" = "Budget";

/* Title for button to see all transactions. */
"Overview.LatestTransactions.SeeAllButton" = "See all";

/* Title for latest transactions list. */
"Overview.LatestTransactions.Title" = "Latest transactions";

/* No statistics data available. */
"Overview.NoDataAvailable" = "No statistics available";

/* Title for the button used to initiate a categorization of a transaction. */
"Transaction.Detail.ChangeCategory" = "Change";

/* Text on button in navigation bar leading to the edit transaction flow. */
"Transaction.Detail.Edit" = "Transaction.Detail.Edit";

/* Title for text field for choosing the date of a transaction. */
"Transaction.Edit.Date.Title" = "Date";

/* Help text below description field describing the original description. */
"Transaction.Edit.Description.Original" = "Original description: %@";

/* Text field placeholder text on the field where you edit a description of a transaction. */
"Transaction.Edit.Description.Placeholder" = "Transaction.Edit.Description.Placeholder";

/* Discard action title for the sheet when the user tries to cancel the edit transaction screen when there are changes. */
"Transaction.Edit.DiscardSheet.Continue" = "Continue";

/* Discard action title for the sheet when the user tries to cancel the edit transaction screen when there are changes. */
"Transaction.Edit.DiscardSheet.Discard" = "Discard";

/* Title for the sheet when the user tries to cancel the edit transaction screen when there are changes. */
"Transaction.Edit.DiscardSheet.Title" = "Are you sure you want to discard your changes?";

/* Navigation button for saving changes to a transaction. */
"Transaction.Edit.SaveButton" = "Save";

/* Title for the view where you edit a specific transaction. */
"Transaction.Edit.Title" = "Edit";

/* Text when failing to fetch transaction. */
"Transaction.Generic.Error" = "Transaction.Generic.Error";

/* Text to display in the transaction list when there are no transactions. */
"Transactions.NoTransactions" = "Transactions.NoTransactions";

/* Week of the year formatter long text. */
"Week.Of.Year.Long" = "week";

/* Week of the year formatter short text. */
"Week.Of.Year.Short" = "w";

